load-test/create-and-fetch-rides.yml
config:
  target: "http://localhost:8010"
  ensure:
    p99: 50
  phases:
    - duration: 30
      arrivalRate: 100
      name: Sustained load
  payload:
    path: "rides.csv"
    fields:
      - "start_lat"
      - "start_long"
      - "end_lat"
      - "end_long"
      - "rider_name"
      - "driver_name"
      - "driver_vehicle"
  processor: './processor.js'
scenarios:
  - name: "Create Rides"
    flow:
      - post:
          url: "/rides"
          json:
            start_lat: "{{ start_lat }}"
            start_long: "{{ start_long }}"
            end_lat: "{{ end_lat }}"
            end_long: "{{ end_long }}"
            rider_name: "{{ rider_name }}"
            driver_name: "{{ driver_name }}"
            driver_vehicle: "{{ driver_vehicle }}"
          capture:
            json: "$.results[0].rideID"
            as: "id"
      - get:
          url: "/rides/{{ id }}"
      - function: 'getOffset'
      - get:
          url: "/rides?limit=50&offset={{ offset }}"